
  <details>
  <summary>terraform/container-instance - Terraform Plan Output (click to expand)</summary>
  
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 0s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]
data.oci_identity_availability_domains.local_ads: Reading...
data.oci_identity_availability_domains.local_ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-2588219643]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_container_instances_container_instance.demo_container_instance will be created
  + resource "oci_container_instances_container_instance" "demo_container_instance" {
      + availability_domain                  = "CwAQ:eu-amsterdam-1-AD-1"
      + compartment_id                       = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q"
      + container_count                      = (known after apply)
      + container_restart_policy             = "ALWAYS"
      + defined_tags                         = (known after apply)
      + display_name                         = "scylladb-container-instance"
      + fault_domain                         = (known after apply)
      + freeform_tags                        = {
          + "project-name" = "scylladb"
        }
      + graceful_shutdown_timeout_in_seconds = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_details                    = (known after apply)
      + shape                                = "CI.Standard.A1.Flex"
      + state                                = (known after apply)
      + system_tags                          = (known after apply)
      + time_created                         = (known after apply)
      + time_updated                         = (known after apply)
      + volume_count                         = (known after apply)

      + containers {
          + arguments                      = [
              + "--listen-address=10.0.1.77",
              + "--rpc-address=10.0.1.77",
              + "--seed-provider-parameters seeds=10.0.1.77",
              + "--alternator-address=10.0.1.77",
              + "--alternator-port=8000",
              + "--alternator-write-isolation=always",
            ]
          + availability_domain            = (known after apply)
          + command                        = (known after apply)
          + compartment_id                 = (known after apply)
          + container_id                   = (known after apply)
          + container_instance_id          = (known after apply)
          + defined_tags                   = (known after apply)
          + display_name                   = "ScyllaDB base image"
          + environment_variables          = (known after apply)
          + exit_code                      = (known after apply)
          + fault_domain                   = (known after apply)
          + freeform_tags                  = (known after apply)
          + image_url                      = "scylladb/scylla:5.4"
          + is_resource_principal_disabled = (known after apply)
          + lifecycle_details              = (known after apply)
          + state                          = (known after apply)
          + system_tags                    = (known after apply)
          + time_created                   = (known after apply)
          + time_terminated                = (known after apply)
          + time_updated                   = (known after apply)
          + working_directory              = (known after apply)
        }

      + shape_config {
          + memory_in_gbs                = 6
          + networking_bandwidth_in_gbps = (known after apply)
          + ocpus                        = 1
          + processor_description        = (known after apply)
        }

      + vnics {
          + defined_tags           = (known after apply)
          + display_name           = "scylladb-container-instance-vnic"
          + freeform_tags          = (known after apply)
          + hostname_label         = "scylladb"
          + is_public_ip_assigned  = false
          + nsg_ids                = (known after apply)
          + private_ip             = "10.0.1.77"
          + skip_source_dest_check = true
          + subnet_id              = "ocid1.subnet.oc1.eu-amsterdam-1.aaaaaaaavxq2fo4ilyaxe5s5oi4smteruiirekbftefn44ua265wg2famcta"
          + vnic_id                = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
